## python 学習ログ
# 2025 12月29日
- 四則演算の優先度を学んだ
- printによって出力
- 変数に代入してからの応用
- input関数によりキーボードの情報を受け取り変数に代入
- 関数の型は四つある

感想：四則演算の優先度は算数と同じ感じだと思った。
- パイソンは関数により多種多様な操作が可能なのだとわかった。
- format関数によって文字列に数値を代入するのは面白いと思った。

## 1/4

- f-string を使った

## コード

- x = 5
y = 7
print(f"{x} + {y} = {x + y}"）
- この変数をnameとかに変えて文を名前を入れた文なども作れる。
  


## 学んだこと
- printの中に変数名を入れてそれに関連したものを出力したい場合文字列の前に f をつける


## 1/5
## 学んだ事
- forma文やfstring文のデメリット

  新しいのを追加したいときに変数を追加したり、すべて同じ処理したい場合文が長くなる。

- 上のデメリットをマシにするためにコンテナがある（一個の変数に複数の単語を収納すること）

  コンテナにはリスト、ディクショナリ、タプル、セットの4つがある

- リストについて学んだ。
- sum関数により変数の中の合計を出力。len関数により変数の中の数を出力。
- スライスによる範囲指定print(変数名[?以上:?未満])?=数字。
- 負数による指定print(変数名[-1])によりリストの末尾を出力。
- リストは０から始まる逆からは−１から始まる。

## コード
scores=[80,70,4732]  
total=sum(scores)  
print(total)  
total=sum(scores)/len(scores)  
print(scores[-1])  
print(scores[1:3])  

## 1/8
## 学んだこと
- リストとディクショナリのちがいについて。  。
リストは添字をpythonが自動につけるが、ディクショナリは開発者が名前をつけるから合計値がなんの合計値なのかがわかりやすくなる。  
- 
## コード
# BMIを出力
height = float(input("身長を入力してください(cm): "))
weight = float(input("体重を入力してください(kg): "))

height = height / 100  # cm → m
BMI = weight / (height * height)

print(BMI)

  
   

 
